create_clock -period 260.000 -name clk -waveform {0.000 130.000} [get_ports clk]

set_input_delay -clock [get_clocks clk] -min -add_delay 20.000 [get_ports {I_in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 30.000 [get_ports {I_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 20.000 [get_ports {Q_in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 30.000 [get_ports {Q_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 20.000 [get_ports fftEn]
set_input_delay -clock [get_clocks clk] -max -add_delay 30.000 [get_ports fftEn]
set_input_delay -clock [get_clocks clk] -min -add_delay 20.000 [get_ports rstn]
set_input_delay -clock [get_clocks clk] -max -add_delay 30.000 [get_ports rstn]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {I_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 20.000 [get_ports {I_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {Q_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 20.000 [get_ports {Q_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports fftValid]
set_output_delay -clock [get_clocks clk] -max -add_delay 20.000 [get_ports fftValid]

